lrn-org/literate-prog/01-code-blocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-26 Sat 00:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bartev Vartanian" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8e1e6c6">1. Source code execution</a>
<ul>
<li><a href="#org0642239">1.1. Ruby</a></li>
<li><a href="#org3d73278">1.2. Shell</a></li>
<li><a href="#org19dc030">1.3. R</a></li>
<li><a href="#org60ce293">1.4. python function</a></li>
</ul>
</li>
<li><a href="#org6f9e900">2. complex example with table as input</a></li>
<li><a href="#org9abf4ed">3. in-line code blocks</a></li>
<li><a href="#org0589355">4. meta-programming language for org-mode</a></li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-ruby">require 'date'
"This file was laste evaluated on #{Date.today}"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">ls -la
</pre>
</div>

<div id="outline-container-org8e1e6c6" class="outline-2">
<h2 id="org8e1e6c6"><span class="section-number-2">1</span> Source code execution</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0642239" class="outline-3">
<h3 id="org0642239"><span class="section-number-3">1.1</span> Ruby</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ruby">require 'date'
"This file was last evaluated on #{Date.today}"
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d73278" class="outline-3">
<h3 id="org3d73278"><span class="section-number-3">1.2</span> Shell</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In the Org-mode file:
</p>

<div class="org-src-container">
<pre class="src src-sh">echo "This file takes up `du -h 01-code-blocks.org |sed 's/\([0-9k]*\)[ ]*org-babel.org/\1/'`"
</pre>
</div>
</div>
</div>

<div id="outline-container-org19dc030" class="outline-3">
<h3 id="org19dc030"><span class="section-number-3">1.3</span> R</h3>
<div class="outline-text-3" id="text-1-3">
<p>
What are the most common words in this file? In the Org-mode file:
</p>

<div class="org-src-container">
<pre class="src src-R">words &lt;- tolower(scan("intro.org", what="", na.strings=c("|",":")))
t(sort(table(words[nchar(words) &gt; 3]), decreasing=TRUE)[1:10])
</pre>
</div>
<p>
HTML export of code:
</p>

<p>
words &lt;- tolower(scan("intro.org", what="", na.strings=c("|",":")))
t(sort(table(words[nchar(words) &gt; 3]), decreasing=TRUE)[1:10])
</p>
</div>
</div>

<div id="outline-container-org60ce293" class="outline-3">
<h3 id="org60ce293"><span class="section-number-3">1.4</span> python function</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python" id="org4b88931">return a * b
</pre>
</div>


<pre class="example">
32
</pre>


<pre class="example">
27
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f9e900" class="outline-2">
<h2 id="org6f9e900"><span class="section-number-2">2</span> complex example with table as input</h2>
<div class="outline-text-2" id="text-2">
<table id="org2e9bca8" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
<td class="org-right">10</td>
<td class="org-right">12</td>
<td class="org-right">14</td>
<td class="org-right">16</td>
<td class="org-right">18</td>
<td class="org-right">20</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1473602">(defun fibonacci (n)
  (if (or (= n 0) (= n 1))
      n
    (+ (fibonacci (- n 1)) (fibonacci (- n 2)))))

(mapcar (lambda (row)
	  (mapcar #'fibonacci row)) fib-inputs))
</pre>
</div>
</div>
</div>


<div id="outline-container-org9abf4ed" class="outline-2">
<h2 id="org9abf4ed"><span class="section-number-2">3</span> in-line code blocks</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>=
{{{results(=40</code>)}}}
</p>
</div>
</div>

<div id="outline-container-org0589355" class="outline-2">
<h2 id="org0589355"><span class="section-number-2">4</span> meta-programming language for org-mode</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh" id="org71dc95a">cd ~ &amp;&amp; du -sc * | grep -v total
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org68d647a">pie(dirs[,1], labels=dirs[,2])
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bartev Vartanian</p>
<p class="date">Created: 2020-12-26 Sat 00:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
